#include <iostream>
using namespace std;

/*
    ΟΝΟΜΑΤΕΠΩΝΥΜΟ: ΑΙΚΑΤΕΡΙΝΗ-ΕΙΡΗΝΗ ΣΦΑΚΙΑΝΟΥ
    ΑΡΙΘΜΟΣ ΜΗΤΡΩΟΥ: ICE20390223
    ΤΜΗΜΑ 17 (ΠΕΜΠΤΗ 12:00-13:00)
    ΑΣΚΗΣΗ 1 ΕΡΩΤΗΜΑ 2
*/

/*
    2. Γράψτε ένα πρόγραμμα το οποίο:
    ● Θα δημιουργεί έναν πίνακα πραγματικών αριθμών Ν θέσεων και θα τον
    γεμίζει με τιμές που διαβάζονται από την standard είσοδο.
    ● Θα τυπώνει τις δύο μεγαλύτερες (διαφορετικές) τιμές του πίνακα. Η εύρεση
    των τιμών θα πραγματοποιηθεί μέσω μίας void συνάρτησης η οποία που
    δεν θα έχει κάποιον pointer ως όρισμα.
    ● Θα διπλασιάζει την ελάχιστη τιμή του πίνακα. Η εύρεση της ελάχιστης τιμής
    θα γίνει με συνάρτηση η οποία θα επιστρέφει μία αναφορά στο στοιχείο του
    πίνακα που περιέχει την ελάχιστη τιμή.
    Το πρόγραμμα θα χρησιμοποιεί τα αντικείμενα cin και cout για την είσοδο και την
    έξοδό του.
*/

//Εκτύπωση των 2 μεγαλύτερων τιμών
void printlargevalues(double a[],int N)
{
    double max=a[0];
    double second_max=a[0];
    for (int i = 0; i < N; i++)
    {
        if (a[i]>max)
        {
            max=a[i];
        }
        
        
    }
    for (int i = 0; i < N; i++)
    {
        
        if (a[i]>second_max && a[i]!=max)
        {
            second_max=a[i];
        }
 
    }
    cout<<"Ο πρώτος μεγαλύτερος αριθμός είναι ο "<<max<<" και ο δεύτερος μεγαλύτερος αριθμός είναι ο "<<second_max<<endl;

}

//Εύρεση ελάχιστης τιμής
double &findmin(double *a,int N)
{
    double min=a[0];
    int thesimin=0;
    for (int i = 0; i < N; i++)
    {
        if (a[i]<min)
        {
            min=a[i];
            thesimin=i;
        }
        
    }
    cout<<"Η μικρότερη τιμή είναι "<<min<<endl;
    return a[thesimin];
}

int main(int argc, char const *argv[])
{
    int N;
    double *k;
    //1.Θα δημιουργεί έναν πίνακα πραγματικών αριθμών Ν θέσεων και θα τον γεμίζει με τιμές που διαβάζονται από την standard είσοδο
    do
    {
        cout<<"Εισαγωγή μεγέθους πίνακα: ";
        cin>>N;
        if (N==0)
        {
            cout<<"Δεν γίνεται το μέγεθος του πίνακα να είναι μηδέν"<<endl;
        }

        if (N<0)
        {
            cout<<"Δεν γίνεται το μέγεθος του πίνακα να είναι αρνητικός αριθμός"<<endl;
        }
        
    } while (N<=0); //Ελέγχει το μέγεθος του πίνακα

    double a[N];

    for (int i = 0; i < N; i++)
    {
        cout<<"Εισαγωγή "<<i+1<<"ου στοιχείου: ";
        cin>>a[i];
    }
    
    /*2ος Τρόπος
    k= new double [N];
    //Ελέγχουμε την δέσμευση μνήμης
    if (!k)
    {
        cout<<"Σφάλμα κατά την δέσμευση της μνήμης"<<endl;
    }

    for (int i = 0; i < N; i++)
    {
        cout<<"Εισαγωγή "<<i+1<<"ου στοιχείου: ";
        cin>>k[i];
    }
    printlargevalues(k,N);
    double& secondmin=findmin(k,N);
    secondmin=2*secondmin;
    cout<<"Η ελάχιστη τιμή διπλασιασμένη είναι "<<secondmin<<endl;
    delete [] k; //Αποδέσμευση Μνήμης
    */

    //2.Θα τυπώνει τις δύο μεγαλύτερες (διαφορετικές) τιμές του πίνακα.
    //Η εύρεση των τιμών θα πραγματοποιηθεί μέσω μίας void συνάρτησης η οποία που δεν θα έχει κάποιον pointer ως όρισμα
    printlargevalues(a,N);

    //3.Θα διπλασιάζει την ελάχιστη τιμή του πίνακα. Η εύρεση της ελάχιστης τιμής θα γίνει με συνάρτηση η οποία θα επιστρέφει μία αναφορά στο στοιχείο του
    //πίνακα που περιέχει την ελάχιστη τιμή. Το πρόγραμμα θα χρησιμοποιεί τα αντικείμενα cin και cout για την είσοδο και την έξοδό του.
    double& min=findmin(a,N);
    min=2*min;
    cout<<"Η ελάχιστη τιμή διπλασιασμένη είναι "<<min<<endl;
    
    return 0;
}
